react-proposal-generator-api/app/serializers/model_serializer.rb

SELECT "model_assemblies".* FROM "model_assemblies" WHERE "model_assemblies"."model_id" = $1  [["model_id", 1]]
SELECT "assemblies".* FROM "assemblies" INNER JOIN "model_assemblies" ON "assemblies"."id" = "model_assemblies"."assembly_id" WHERE "model_assemblies"."model_id" = $1  [["model_id", 1]]
---
  def assemblies
    self.object.model_assemblies.map do |ma|
      {
        id: ma.assembly_id,
        name: Assembly.all.where(id: ma.assembly_id)