react-proposal-generator-api/app/controllers/assemblies_controller.rb

SELECT "assemblies".* FROM "assemblies" INNER JOIN "model_assemblies" ON "assemblies"."id" = "model_assemblies"."assembly_id" WHERE "model_assemblies"."model_id" = $1  [["model_id", 1]]
SELECT "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    assemblies = Model.find_by_id(params[:model_id]).assemblies