react-proposal-generator-api/app/controllers/items_assemblies_controller.rb

SELECT "items_assemblies".* FROM "items_assemblies" WHERE "items_assemblies"."assembly_id" = $1  [["assembly_id", 1]]
---
  def index
    items_assemblies = ItemsAssembly.where(assembly_id: params[:assembly_id])