react-proposal-generator-api/app/controllers/items_controller.rb

  def index
    items = Assembly.find_by_id(params[:assembly_id]).items
---
SELECT "items".* FROM "items" INNER JOIN "items_assemblies" ON "items"."id" = "items_assemblies"."item_id" WHERE "items_assemblies"."assembly_id" = $1  [["assembly_id", 39]]
SELECT "assemblies".* FROM "assemblies" WHERE "assemblies"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]