react-proposal-generator-api/app/controllers/model_assemblies_controller.rb

SELECT "model_assemblies".* FROM "model_assemblies" WHERE "model_assemblies"."model_id" = $1  [["model_id", 1]]
---
  def index
    model_assemblies = ModelAssembly.all.where(model_id: params[:model_id])